Revit 2027 API
ParameterTypeId.ThermalMaterialThickness Property
 "Thickness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ThermalMaterialThickness { get; }
Public Shared ReadOnly Property ThermalMaterialThickness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ThermalMaterialThickness {
	ForgeTypeId^ get ();
}
static member ThermalMaterialThickness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace